artefacts/ess-org-beamer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-14 Wed 18:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to Org Mode for ESS users</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Greg Minshall" />
<link href="./ess-org-beamer.css" rel="stylesheet"/>
</head>
<body>
<div id="content">
<h1 class="title">Introduction to Org Mode for ESS users
<br />
<span class="subtitle"><a href="https://ess-intro.github.io/"><span class="underline">part of the ESS intro series</span></a></span>
</h1>
<div id="outline-container-org24c4531" class="outline-2">
<h2 id="org24c4531"><span class="section-number-2">1</span> Org Mode</h2>
<div class="outline-text-2" id="text-1">
<p>
"If Emacs is the distribution, Org Mode is the entire desktop
environment one runs on top of it."
</p>

<p>
Emacs Org Mode is an outline-structured, plain text, file format and
backing software that allows you to (among many other things)
</p>
<ul class="org-ul">
<li>markup text via <b>asteriskizing</b>, <code>equalizing</code>, <del>plusizing</del>,
<i>slashizing</i>, <code>tildeizing</code>, <span class="underline">underscorizing</span>, etc.</li>
<li>export a file, or a subtree of it, as, e.g., an .html or .pdf file</li>
<li>take notes</li>
<li>create agendas (items with date elements)</li>
<li>organize your LIFE!</li>
<li>do calculations &#x2013; good support for math, LaTeX, etc.</li>
<li>table support for storing information (including support for
formulae)</li>
</ul>
</div>
</div>

<div id="outline-container-orgc31e6b8" class="outline-2">
<h2 id="orgc31e6b8"><span class="section-number-2">2</span> Babel &#x2013; Org Mode support for programming</h2>
<div class="outline-text-2" id="text-2">
<p>
One can write source code in "source blocks".  Source blocks have the
following attributes:
</p>

<ul class="org-ul">
<li>a name (optional)</li>
<li>source code, one language per source block (though, if desired,
multiple languages per file)</li>
<li>"header arguments", parameters which define how a source block
interacts with its environment</li>
</ul>
</div>
</div>

<div id="outline-container-org25a9815" class="outline-2">
<h2 id="org25a9815"><span class="section-number-2">3</span> "To a source block", you can</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><b>evaluate</b> it (<code>[C-c C-c]</code><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>) to produce results, which, in turn, may be used as input to
another source block.  <b>NB:</b> there are security issues here: you
will need to customize the Emacs variable <code>org-babel-load-languages</code>
, and you will be prompted each time before a code block is
evaluated</li>
<li><b>export</b> (<code>[C-c C-e]</code>) the code, its results, or both, with
other parts of the .org file, into a .html, .pdf, or other format
file</li>
<li><b>tangle</b> it (<code>[C-c C-v t]</code>), that is, write the source code itself
into a separate file, that might be used as input to a compilation
or some other packaging step, or be a stand alone script (<code>Rscript</code>,
say).</li>
<li><b>edit</b> it, either in place in the Org buffer, or "stand alone" in an
<i>OrgSrc</i> buffer (<code>[C-c ']</code><sup><a id="fnr.1.100" class="footref" href="#fn.1">1</a></sup>), with the major mode set to
that of the language (so, for R, <code>ESS[R]</code>).</li>
</ul>
</div>
</div>


<div id="outline-container-orgf679411" class="outline-2">
<h2 id="orgf679411"><span class="section-number-2">4</span> R source blocks</h2>
<div class="outline-text-2" id="text-4">
<p>
In particular, one can have a source block with R code
</p>
<div class="org-src-container">
<pre class="src src-org"><span class="org-org-block-begin-line">#+begin_src R :results value</span>
    "here, the last value executed is the result"
<span class="org-org-block-end-line">#+end_src</span>

<span class="org-org-block-begin-line">#+begin_src R :results output</span>
    cat("here, the output is the result\n")
<span class="org-org-block-end-line">#+end_src</span>
</pre>
</div>

<p>
To evaluate a source block, type <code>[C-c C-c]</code> or <code>[C-c C-v e]</code>.
</p>

<p>
To edit this source block in an OrgSrc buffer with major mode
<code>ESS[R]</code>, type <code>[C-c ']</code>.  To close the OrgSrc buffer and return to
the Org buffer, type <code>[C-c ']</code> again.
</p>
</div>
</div>

<div id="outline-container-orge5e734a" class="outline-2">
<h2 id="orge5e734a"><span class="section-number-2">5</span> Header arguments</h2>
<div class="outline-text-2" id="text-5">
<dl class="org-dl">
<dt>:noweb</dt><dd>allows code from another place in the org file to be
inserted at a point in the current org file when evaluating or
exporting.</dd>
<dt>:var</dt><dd>allows results of other computations in an org file to be
used as input to this source block</dd>
<dt>:results</dt><dd>defines how results are collected after evaluation of
the source block, and how (or whether) they are inserted into the
org buffer</dd>
<dt>:session</dt><dd>outlined on next slide</dd>
<dt>:tangle</dt><dd>name of file to which to <i>tangle</i> the contents of this
source block</dd>
</dl>
</div>
</div>

<div id="outline-container-org5ea88aa" class="outline-2">
<h2 id="org5ea88aa"><span class="section-number-2">6</span> <code>:session</code> header argument</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Normally, Org Mode evaluates a source block by forking a new R
subprocess, passing it the code (and any variables to be used as
input), letting the code run, capturing the results, and then
disposing of the R subprocess.  This ensures that code runs in a
fresh environment.</li>

<li>Often, especially when doing statistical analysis, we would like to
build up state over time, by executing various code blocks, and/or
by poking in the environment.</li>

<li>Also, we may want to debug our code in a convenient way.</li>
</ul>

<p>
The <code>:session</code> header argument causes evaluation of a source block to
take place in a long-running inferior ESS (<code>iESS</code>) process; all source
code blocks with the same <code>:session</code> name run in the same <code>iESS</code>
process.
</p>
</div>
</div>

<div id="outline-container-orge9077db" class="outline-2">
<h2 id="orge9077db"><span class="section-number-2">7</span> A style of working</h2>
<div class="outline-text-2" id="text-7">
<p>
In Emacs, I find that I flit between three buffers:
</p>
<ul class="org-ul">
<li>the .org file
<ul class="org-ul">
<li>often doing minor in-line edits in a source block</li>
</ul></li>
<li>an OrgSrc edit buffer
<ul class="org-ul">
<li>for more major edits (and get font lock, etc.)</li>
<li>these buffers come and go, as needed</li>
</ul></li>
<li>the R <code>:session</code> buffer to
<ul class="org-ul">
<li>run code</li>
<li>examine state</li>
<li>debug as needed</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1d4b4b3" class="outline-2">
<h2 id="org1d4b4b3"><span class="section-number-2">8</span> Other resources</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>the official <a href="https://orgmode.org/quickstart.html">Quick Start</a> guide, a very good introduction to Org Mode</li>

<li>the <a href="https://orgmode.org/">Org Mode</a> web page</li>

<li>the Org Mode <a href="https://orgmode.org/worg/">worg</a> site (you may find it useful to take a linear
stroll through <a href="https://orgmode.org/worg/sitemap.html">the worg site map</a>)</li>

<li>the other presentations in this <a href="https://ess-intro.github.io/">ESS intro series</a></li>

<li>the beamer slides for this tutorial are <a href="https://ess-intro.github.io/presentation-org-mode/artefacts/ess-org-beamer.html">here</a> (<a href="https://ess-intro.github.io/presentation-org-mode/artefacts/ess-org-beamer.pdf">pdf</a>)</li>

<li>a <a href="https://ess-intro.github.io/presentation-org-mode/artefacts/ess-org-demo-expanded.org">.org file</a> for experimenting (an HTML version <a href="https://ess-intro.github.io/presentation-org-mode/artefacts/ess-org-demo-results.html">here</a> and a PDF
one <a href="https://ess-intro.github.io/presentation-org-mode/artefacts/ess-org-demo-results.pdf">here</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org50b720b" class="outline-2">
<h2 id="org50b720b"><span class="section-number-2">9</span> Tutorials, Videos</h2>
<div class="outline-text-2" id="text-9">
<p>
There are some nice tutorials:
</p>

<ul class="org-ul">
<li>a somewhat older one is from Erik Iverson, <a href="https://github.com/erikriverson/org-mode-R-tutorial/blob/master/org-mode-R-tutorial.org">org-mode-R-tutorial.org</a></li>
<li>a more recent one from Vikas Rawal, <a href="https://github.com/vikasrawal/orgpaper/blob/master/orgpapers.org">orgpapers.org</a></li>
</ul>

<p>
And, some videos, including:
</p>

<ul class="org-ul">
<li>Rainer König's <a href="https://www.youtube.com/playlist?list=PLVtKhBrRV_ZkPnBtt_TD1Cs9PJlU0IIdE">screencasts</a> about Org Mode (also available as a
<a href="https://www.udemy.com/course/getting-yourself-organized-with-org-mode/?referralCode=D0CB0D077ED5EC0788F7">course on Udemy</a>)</li>
<li>DT ("Distro Tube"?) has yet another <a href="https://www.youtube.com/watch?v=Ea_-TaEGa7Y">introductory video</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org0a0b4d6" class="outline-2">
<h2 id="org0a0b4d6"><span class="section-number-2">10</span> Farewell</h2>
<div class="outline-text-2" id="text-10">
<p>
Thank you for "attending" this tutorial.  I hope it has given you a
sense of Org Mode.  This has been more of a teaser than an exhaustive
introduction, but the resources listed above should be enough to ease
you into using R with Org Mode.
</p>
</div>

<ol class="org-ol">
<li><a id="orgdaa04ef"></a>Acknowledgements<br />
<div class="outline-text-4" id="text-10-0-1">
<p>
Thanks to all the authors, maintainers, and cooperative users of R,
Emacs, ESS, and the like.  While I retain responsibility for errors,
for specific suggestions on this tutorial I thank C Berry and
V Arel-Bundock.
</p>
</div>
</li>
</ol>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">with <code>point</code> in the source
block</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Greg Minshall</p>
<p class="date">Created: 2021-04-14 Wed 18:09</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
